"""
Какие нужны инструменты для улучшения поиска по меню?


get_menu_by_categories
    Отдает нейронке куски меню по отдельным категориям


get_dish_by_id
    Получение конкретного блюда по его id


calculate_sum_by_ids
    Получение суммы заказа


find_dishes_by_name
    Поиск блюд по названию
    Возможно ранжирование по смыслу


find_dishes_by_query
    Поиск блюд по запросу, находятся по cosine


Какие бы хотелось сделать фильтрации:
    - По аллергенам
    - По ингредиентам
    - По цене
    - По граммовке
    - Категории: закуски/кейтеринг/горячее/напитки и т.д.

"""
